Revit 2027 API
NumberingFormatSettings.RemoveParameter Method
 Remove a parameter from a specific index. The position where the parameter to be removed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveParameter(
	int index
)
Public Sub RemoveParameter (
	index As Integer
)
public:
void RemoveParameter(
	int index
)
member RemoveParameter :
        index : int -> unit
Parameters
index Int32
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The parameters container must not be empty. The provided index is index -or- index must be in range between 0 and NumberOfParameters.
See Also
Reference
NumberingFormatSettings Class
Autodesk.Revit.DB Namespace